---
kind: property
id: P:Autodesk.Revit.DB.Subelement.Element
zh: 构件、图元、元素
source: html/507946d2-87d1-ccc4-d174-7f5e789ceadd.htm
---
# Autodesk.Revit.DB.Subelement.Element Property

**中文**: 构件、图元、元素

The element in which the subelement resides.

## Syntax (C#)
```csharp
public Element Element { get; }
```

## Remarks
If subelement refers to whole element, this element is returned.